#include <stdio.h>

int x = 2;

int f1(int rr)
{
    int rs = 1;

    for (int i = 1; i <= rr; i++) {
        rs *= x;
    }

    return rs;
}

int main()
{
    int n;
    int res = 0;

    printf("Enter N: ");
    scanf("%d", &n);

    for (int i = 1; i <= n; i++) {
        res += f(i);
    }

    printf("Result is %d", res);
    return 0;
}

//Предполагаю что программа выводит на экран степень двойки минус 2

//Работа исходной программы :
//1    2
//2    6
//3    14
//4    30
//5    62
//6    126
//7    254     
//8    510 
//9    1022
//10   2046
//Работа программы восстановленной:
//1    2
//2    6
//3    14
//4    30
//5    62
//6    126
//7    254     
//8    510 
//9    1022
//10   2046
