# Кожевников А.В. гр. 1093
# Вариант 6


# Восстановленный исходный текст программы на языке Си


#include <stdio.h>


int main()
{
  int v4; 
  int n;
  int m;
  printf("Enter two numbers: ");
  scanf("%d%d", &n, &m);
  while ( m )
  {
    n %= m;
    v4 = m;
    m = n;
    n = v4;
  }
  printf("Result is %d", (unsigned int)n);
  return 0;
}


# Тест программ:
#========================================================================
#| Входные данные  |  Результат оригинала  |  Результат восстановленной |
#========================================================================
#|      1  1       |           1           |              1             |
#|      2  1       |           1           |              1             |
#|      10 1       |           1           |              1             |
#|      10 7       |           1           |              1             |
#|      10 5       |           5           |              5             |
#|      15 6       |           3           |              3             |
#|      0  0       |           0           |              0             |
#|      2  0       |           2           |              2             |
#========================================================================


#Ответы на вопросы:

# 1. n,m два числа, которые вводит пользователь. 
#    var_4 - дополнительная переменная, которая используется в цикле

# 2. Кроме printf и scanf функций нет

# 3. Программа получает результат следующим образом:
# 3.1 Берем остаток деления a от b
# 3.2.1 Если остаток от деления равен нулю, то результатом программы будет b.
# 3.2.2 Иначе a будет равно b, b будет равно остатку от деления. Возвращаемся к пункту 3.1

# Если кратко, то результатом программы является:
# Последний делитель, при котором частное остатка от деления будет равно 0.


# Оригинал программы


 var_8           = dword ptr -8
 var_4           = dword ptr -4

                push    rbp
                mov     rbp, rsp
                sub     rsp, 10h
                mov     [rbp+var_8], 0
                lea     rdi, format     ; "Enter two numbers: "
                mov     eax, 0
                call    _printf
                lea     rdx, m
                lea     rsi, n
                lea     rdi, aDD        ; "%d%d"
                mov     eax, 0
                call    _scanf

 loc_5555D736E6C9:              
                mov     eax, cs:m
                test    eax, eax
                jz      short loc_5555D736E70A
                mov     eax, cs:n
                mov     ecx, cs:m
                cdq
                idiv    ecx
                mov     eax, edx
                mov     cs:n, eax
                mov     eax, cs:m
                mov     [rbp+var_4], eax
                mov     eax, cs:n
                mov     cs:m, eax
                mov     eax, [rbp+var_4]
                mov     cs:n, eax
                jmp     short loc_5555D736E6C9


                mov     eax, cs:n
                mov     esi, eax
                lea     rdi, aResultIsD ; "Result is %d"
                mov     eax, 0
                call    _printf
                mov     eax, 0
                leave
                retn
 main           endp



